Revit 2027 API
Curve.GetEndPointReference Method
Returns a stable reference to the start point or the end point of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetEndPointReference(
	int index
)
Public Function GetEndPointReference (
	index As Integer
) As Reference
public:
Reference^ GetEndPointReference(
	int index
)
member GetEndPointReference :
        index : int -> Reference
Parameters
index Int32
Use 0 for the start point; 1 for the end point.
Return Value
Reference
Reference to the point or null if reference cannot be obtained.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the specified index is not 0 or 1.
InvalidOperationException |  Thrown when the object is internally marked as read-only or this curve is unbound.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace